Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/tax_on_savings_and_investments/employee_share_option_schemes.html.txt.tmx
Source language: en
Languages: ga

source: Employee share option schemes
ga: Scéimeanna Scaireanna Fostaithe in Éirinn

source: In Ireland, employees can avail of certain share options from their company that may be 'tax free' or 'tax efficient'
ga: In Éirinn, is féidir le fostaithe roghanna faoi leith scaireanna a ghlacadh óna gcomhlacht a d'fhéadfadh a bheith "saor ó cháin" nó "cáin éifeachtúil"

source: However, it is useful to bear in mind that there are few benefits employees can receive that are completely 'tax free'
ga: Ach, de bharr athruithe sa reachtaíocht in Éirinn is féidir le fostaithe leas a baint as rath a gcomhlacht gan dliteanais mhóra cánacha titim orthu

source: There are two main ways an employee can benefit from shares in the company:
ga: Tá dhá phríomh bhealach gur féidir le fostaí leas a bhaint as scaireanna sa chomhlacht:

source: • Approved Profit Sharing Schemes
ga: • Scéimeanna Ceadaithe le Brabús a Roinnt

source: Approved Profit Sharing Schemes
ga: Scéimeanna Ceadaithe le Brabús a Roinnt

source: Approved Profit Sharing Schemes allow an employer to give an employee shares in the company up to a maximum value of €12,700 per year tax-free
ga: Tugann Scéimeanna Ceadaithe le Brabús a Roinnt deis don fhostóir scaireanna sa chomhlacht a thabhairt don fhostaí suas go dtí uasluach de 12,700 euro sa bhliain saor ó cháin

source: Approved Profit Sharing Schemes are subject to certain conditions set out in legislation and administered by the Revenue Commissioners
ga: Tá coinníollacha faoi leith ag baint le Scéimeanna Ceadaithe le Brabús a Roinnt atá leagtha síos i reachtaíocht agus atá dhá riaradh ag na Coimisinéirí Ioncaim

source: Providing the scheme meets the required conditions, an employee will pay no tax on shares up to a maximum value of €12,700 per year
ga: Má shásaíonn an scéim na coinníollacha, ní íocfaidh fostaí aon cháin ar scaireanna suas go dtí uasluach de 12,700 euro sa bhliain

source: The employer must hold the shares for a period of time (called the "retention period") and the employee must not dispose of the shares before three years
ga: Ní mór don fhostóir na scaireanna a choinneáil ar feadh tréimhse ama (ar a dtugtar an "tréimhse choinneála") agus ní féidir leis an bhfostaí fáil réidh leis na scaireanna sula mbíonn trí bliana caithe

source: If an employee disposes of shares before this time, he or she is liable to pay income tax on whichever is the lower of the following:
ga: Má fhaigheann fostaí réidh leis na scaireanna roimhe sin, beidh air/uirthi cáin ioncaim a íoc ar pé acu is lú eatarthu seo a leanas:

source: • The market value of the shares when they were given to the employee or,
ga: • Luach margaidh na scaireanna nuair a tugadh don fhostaí iad, nó,

source: • The value of the shares at the time of sale
ga: • Luach na scaireanna ag am an díolacháin

source: Approved Profit Sharing Schemes are subject to a number of conditions that should be checked with the Revenue Commissioners
ga: Tá roinnt coinníollacha a bhaineann le Scéimeanna Ceadaithe le Brabús a Roinnt agus ba cheart iad a chinntiú leis na Coimisinéirí Ioncaim

source: More information can be found in Revenue's publication Approved Profit Sharing Schemes IT62 (pdf)
ga: Is féidir tuilleadh a léamh anseo maidir le Scéimeanna Ceadaithe le Brabús a Roinnt (pdf)

source: Revenue approved Savings-related Share Option Schemes allow you to save for and purchase share options in your employer's company tax effectively
ga: Gearrtar an Cháin ar Ghnóthacháin Chaipitiúla ar an difríocht idir an bpraghas ceannaithe agus an praghas a dhíoltar na scaireanna air ina dhiaidh sin

source: You should check with the Revenue Commissioners and your employer as to what rules apply to your share options and when you are liable to pay tax
ga: Tá cáin iníochta ar gach díbhinn a éiríonn as scéimeanna le brabús a roinnt agus scéimeanna roghanna scaireanna

source: You can find information in Revenue's publication A Guide to Savings-Related Share Option Schemes (pdf) and in Revenue's eBrief No
ga: Tá sé tábhachtach déanamh cinnte leis na Coimisinéirí ioncaim agus le do fhostóir cé na rialacha a bhaineann le do roghanna scaireanna agus cén uair a mbeidh cáin le n-íoc agat, má bhíonn
